---
kind: method
id: M:Autodesk.Revit.DB.GroupSetIterator.#ctor
source: html/63a5a3e3-a388-b6fc-53b9-53510dadfa11.htm
---
# Autodesk.Revit.DB.GroupSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public GroupSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.